# Author: Panzhou

import os
import random
from datetime import date
from datetime import timedelta
import base64


 
def random_name():
    # 删减部分小众姓氏
    # firstName = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻水云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳鲍史唐费岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅卞齐康伍余元卜顾孟平" \
    #             "黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计成戴宋茅庞熊纪舒屈项祝董粱杜阮席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田胡凌霍万柯卢莫房缪干解应宗丁宣邓郁单杭洪包诸左石崔吉" \
    #             "龚程邢滑裴陆荣翁荀羊甄家封芮储靳邴松井富乌焦巴弓牧隗山谷车侯伊宁仇祖武符刘景詹束龙叶幸司韶黎乔苍双闻莘劳逄姬冉宰桂牛寿通边燕冀尚农温庄晏瞿茹习鱼容向古戈终居衡步都耿满弘国文东殴沃曾关红游盖益桓公晋楚闫"
    # 百家姓姓氏
    firstName = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平" \
                "黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董粱杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮" \
                "龚程嵇邢滑裴陆荣翁荀羊於惠甄麴家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴欎胥能苍" \
                "双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍舄璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东殴殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空" \
                "曾毋沙乜养鞠须丰巢关蒯相查後荆红游竺权逯盖益桓公晋楚闫法汝鄢涂钦归海帅缑亢况后有琴梁丘左丘商牟佘佴伯赏南宫墨哈谯笪年爱阳佟言福百家姓终"
    # 百家姓中双姓氏
    firstName2="万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于单于太叔申屠公孙仲孙轩辕令狐钟离宇文长孙慕容鲜于闾丘司徒司空亓官司寇仉督子颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父谷梁段干百里东郭南门呼延羊舌微生梁丘左丘东门西门南宫南宫"
    # 女孩名字
    girl = '秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽'
    # 男孩名字
    boy = '伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾楠榕风航弘'
    # 名
    name = '中笑贝凯歌易仁器义礼智信友上都卡被好无九加电金马钰玉忠孝'
 
    # 10%的机遇生成双数姓氏
    if random.choice(range(100))>10:
        firstName_name =firstName[random.choice(range(len(firstName)))]
    else:
        i = random.choice(range(len(firstName2)))
        firstName_name =firstName2[i:i+2]
 
    sex = random.choice(range(2))
    name_1 = ""
    if random.randint(0,114514)<10:
        return '骨灰扬诺夫'
    # 生成并返回一个名字
    if sex > 0:
        girl_name = girl[random.choice(range(len(girl)))]
        if random.choice(range(2)) > 0:
            name_1 = name[random.choice(range(len(name)))]
        return firstName_name + name_1 + girl_name
    else:
        boy_name = boy[random.choice(range(len(boy)))]
        if random.choice(range(2)) > 0:
            name_1 = name[random.choice(range(len(name)))]
        return firstName_name + name_1 + boy_name
 
 
# for i in range(100):
#     print(random_name())


def random_id():
    mid=random.randint(100000,999999)
    return '2023'+str(mid)


def random_time():
    y=random.choice(['2023','2024','2025','2026'])
    m=str(random.randint(1,12))
    d=str(random.randint(1,31))
    h=str(random.randint(0,23))
    mini=str(random.randint(0,59))
    sec=str(random.randint(0,59))
    return y+'-'+m+'-'+d+' | '+h+':'+mini+':'+sec
# set_of_guys=['',]
# print(random_time())

def rand_event():
    events=['不按规定着装','睡觉','呼吸','吃东西','迟到','早退',
    '旷工',
    '工作时间玩游戏',
    '收受贿赂',
    '公款私用',
    '不服从上级安排',
    '恶意损坏他人财产',
    '散布谣言',
    '性骚扰',
    '种族歧视',
    '打架斗殴',
    '酗酒',
    '吸毒',
    '在办公场所吸烟',
    '未经允许使用公司资源',
    '利用职务之便谋取私利',
    '侵犯他人知识产权',
    '违反保密协议',
    '虚假报销',
    '违规操作机器设备',
    '私自更改工作时间',
    '在社交媒体上发表不当言论',
    '偷吃别人母亲骨灰',
    '偷吃别人母亲骨灰',
    '偷吃别人母亲骨灰',
    '偷吃别人母亲骨灰',
    '偷吃别人母亲骨灰',
    '偷吃别人母亲骨灰',
    "激怒共工怒触不周山", "偷女娲补天的石头", "挑唆炎黄大战", "蛊惑蚩尤与黄帝决一死战", "教唆启夺权把公天下变成家天下",
    "妹喜是他安插进夏桀身边的", "纣王建酒池肉林是他帮忙出谋划策的", "周幽王用烽火撩妹子是他的主意", "礼崩乐坏是他在暗中推动的",
    "秦灭六国有他做卧底", "白起杀人的坑就是他刨的", "焚书坑儒是蛊惑秦始皇干的", "陈胜吴广的那套鱼肚子塞布装狐狸叫都是他教的",
    "项羽乌江边看到的字就是他写的", "司马家族是他的后人", "杨广那套吃喝玩乐的东西都是他负责帮忙安排的", "李世民玄武门兵变是他教唆的",
    "安史之乱就是他给安禄山吹枕边风", "烛影斧声他是刀斧手队长", "蒙古人南下他是向导", "吊死崇祯的歪脖子树就是他种的",
    "清军入关就是他开的门", "八国联军清华是他带的路", "火烧圆明园是他给洋人递的火", "日本人是他的后代", "四一二事件就是他出卖的情报",
    "双截棍打莱莱", "火烧巴黎圣母院", "激光笔照geigei", "西征欧洲，发动烧杀抢掠将含有黑死病的尸体扔进城里",
    "屠杀北美的印第安人",
    "发明三角贸易",
    "殖民印度，导致数十次大饥荒",
    "在中国售卖鸦片",
    "烧毁圆明园",
    "强迫中国签订瑷珲条约",
    "将刚果河流域设置为刚果自由邦，奴役刚果人",
    "全歼北洋海军，强迫中国签订马关条约",
    "带领八国联军进入北京烧杀抢掠",
    "射杀斐迪南大公",
    "发明毒气战",
    "将百万犹太人关进集中营",
    "偷袭珍珠港",
    "组织巴丹死亡行军",
    "扶持杜瓦利埃上台",
    "组织欧芹大屠杀",
    "策划政变，推翻危地马拉改革派总统阿本斯",
    "向越南撒橙剂",
    "帮助波波上台，对柬埔寨去城市化",
    "对东帝汶进行种族灭绝",
    "炸毁泛美航空103号班机",
    "进行种族隔离政策，囚禁曼德拉",
    "入侵科威特",
    "屠杀卢旺达的图西族",
    "发动利比里亚内战和塞拉利昂内战",
    "轰炸南联盟",
    "对以色列进行火箭弹袭击",
    "轰炸加沙",
    "在公共场所大声喧哗",
    "抢小朋友的棒棒糖",
    "随地乱扔垃圾",
    "在地铁上不给老人让座",
    "网络上恶意攻击他人",
    "欺负流浪动物",
    "教唆别人做坏事",
    "故意传播虚假信息",
    "在游戏中作弊",
    "偷吃别人的外卖",
        "谋杀了某人的母亲",
    "将他人的母亲杀害",
    "对他人的母亲进行了致命攻击",
    "夺走了他人母亲的性命",
    "实施了杀害他人母亲的罪行",
    "残忍地杀害了一位母亲",
    "结束了他人母亲的生存",
    "对他人的母亲进行了暴力致死",
    "犯下了杀害母亲的大罪",
    "无情地夺走他人了母亲的性命",
    "执行了对他人母亲的谋杀",
    '把木马牵进特洛伊城', '勾结大流士一世远征希腊', '挑拨各部将之间的关系导致马其顿帝国分裂', '撺掇布鲁图刺杀恺撒', '逼迫西罗马皇帝退位导致西罗马灭亡', '在欧洲散播查士丁尼大瘟疫', '在矮子丕平和教宗之间牵线搭桥致使丕平成功篡位', '说服威尼斯总督带领十字军洗劫君士坦丁堡', '煽动勃艮第人抓捕圣女贞德', '作为内应在君士坦丁堡为奥斯曼帝国军队打开城门', '煽动英格兰内部矛盾挑起玫瑰战争', '教唆教皇售卖赎罪券', '烧死布鲁诺', '在布拉格把皇帝的钦差抛出窗外挑起三十年战争', '策划俄普奥三国瓜分波兰导致波兰亡国', '聘请法师操纵天气导致拿破仑远征俄国失败', '刺杀斐迪南大公'

    ]
    return random.choice(events)


def rand_cam():
    cam_list=['西北角枪机','骨灰盒上方球机','灵堂直播间摄像机','墓室内东南角球机','东北角广视角球机','洗手池下方热成像机','骨灰盒内传感器']
    return random.choice(cam_list)

# print(rand_event())

def a_record():
    rec=random_time()+','+random_id()+','+random_name()+','+rand_event()+','+rand_cam()+',周攀'
    return rec
# print(a_record())

with open('违纪行为登记-16.csv', 'w') as file:
    file.write('时间 , 学号, 姓名, 违纪事项, 摄像头, 上报者')
    for i in range(110):
        file.write('\n'+a_record())
    encoded_data = b'5ZGo5pSA5L2g5aaI5q275LqG'
    decoded_data = base64.b64decode(encoded_data)
    print(decoded_data.decode('utf-8')) 
